{
  "architectures": [
    "Qwen2ForCausalLM"
  ],
  "attention_dropout": 0.0,
  "bos_token_id": 151643,
  "eos_token_id": 151645,
  "hidden_act": "silu",
  "hidden_size": 896,
  "initializer_range": 0.02,
  "intermediate_size": 4864,
  "max_position_embeddings": 32768,
  "max_window_layers": 21,
  "model_type": "qwen2",
  "num_attention_heads": 14,
  "num_hidden_layers": 24,
  "num_key_value_heads": 2,
  "rms_norm_eps": 1e-06,
  "rope_theta": 1000000.0,
  "sliding_window": 32768,
  "tie_word_embeddings": true,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.43.1",
  "use_cache": true,
  "use_sliding_window": false,
  "vocab_size": 151936,
  
  "quantization": {
    "model.layers.0.input_layernorm.weight": "bfloat16",
    "model.layers.0.mlp.down_proj.scales": "bfloat16",
    "model.layers.0.mlp.down_proj.weight": "int8",
    "model.layers.0.mlp.gate_proj.scales": "bfloat16",
    "model.layers.0.mlp.gate_proj.weight": "int8",
    "model.layers.0.mlp.up_proj.scales": "bfloat16",
    "model.layers.0.mlp.up_proj.weight": "int8",
    "model.layers.0.post_attention_layernorm.weight": "bfloat16",
    "model.layers.0.self_attn.k_proj.bias": "int8",
    "model.layers.0.self_attn.k_proj.bias.scales": "bfloat16",
    "model.layers.0.self_attn.k_proj.weight": "int8",
    "model.layers.0.self_attn.k_proj.weight.scales": "bfloat16",
    "model.layers.0.self_attn.o_proj.weight": "int8",
    "model.layers.0.self_attn.o_proj.weight.scales": "bfloat16",
    "model.layers.0.self_attn.q_proj.bias": "int8",
    "model.layers.0.self_attn.q_proj.bias.scales": "bfloat16",
    "model.layers.0.self_attn.q_proj.weight": "int8",
    "model.layers.0.self_attn.q_proj.weight.scales": "bfloat16",
    "model.layers.0.self_attn.v_proj.bias": "int8",
    "model.layers.0.self_attn.v_proj.bias.scales": "bfloat16",
    "model.layers.0.self_attn.v_proj.weight": "int8",
    "model.layers.0.self_attn.v_proj.weight.scales": "bfloat16",

    "model.layers.1.input_layernorm.weight": "bfloat16",
    "model.layers.1.mlp.down_proj.scales": "bfloat16",
    "model.layers.1.mlp.down_proj.weight": "int8",
    "model.layers.1.mlp.gate_proj.scales": "bfloat16",
    "model.layers.1.mlp.gate_proj.weight": "int8",
    "model.layers.1.mlp.up_proj.scales": "bfloat16",
    "model.layers.1.mlp.up_proj.weight": "int8",
    "model.layers.1.post_attention_layernorm.weight": "bfloat16",
    "model.layers.1.self_attn.k_proj.bias": "int8",
    "model.layers.1.self_attn.k_proj.bias.scales": "bfloat16",
    "model.layers.1.self_attn.k_proj.weight": "int8",
    "model.layers.1.self_attn.k_proj.weight.scales": "bfloat16",
    "model.layers.1.self_attn.o_proj.weight": "int8",
    "model.layers.1.self_attn.o_proj.weight.scales": "bfloat16",
    "model.layers.1.self_attn.q_proj.bias": "int8",
    "model.layers.1.self_attn.q_proj.bias.scales": "bfloat16",
    "model.layers.1.self_attn.q_proj.weight": "int8",
    "model.layers.1.self_attn.q_proj.weight.scales": "bfloat16",
    "model.layers.1.self_attn.v_proj.bias": "int8",
    "model.layers.1.self_attn.v_proj.bias.scales": "bfloat16",
    "model.layers.1.self_attn.v_proj.weight": "int8",
    "model.layers.1.self_attn.v_proj.weight.scales": "bfloat16",

    "model.layers.2.input_layernorm.weight": "bfloat16",
    "model.layers.2.mlp.down_proj.scales": "bfloat16",
    "model.layers.2.mlp.down_proj.weight": "int8",
    "model.layers.2.mlp.gate_proj.scales": "bfloat16",
    "model.layers.2.mlp.gate_proj.weight": "int8",
    "model.layers.2.mlp.up_proj.scales": "bfloat16",
    "model.layers.2.mlp.up_proj.weight": "int8",
    "model.layers.2.post_attention_layernorm.weight": "bfloat16",
    "model.layers.2.self_attn.k_proj.bias": "int8",
    "model.layers.2.self_attn.k_proj.bias.scales": "bfloat16",
    "model.layers.2.self_attn.k_proj.weight": "int8",
    "model.layers.2.self_attn.k_proj.weight.scales": "bfloat16",
    "model.layers.2.self_attn.o_proj.weight": "int8",
    "model.layers.2.self_attn.o_proj.weight.scales": "bfloat16",
    "model.layers.2.self_attn.q_proj.bias": "int8",
    "model.layers.2.self_attn.q_proj.bias.scales": "bfloat16",
    "model.layers.2.self_attn.q_proj.weight": "int8",
    "model.layers.2.self_attn.q_proj.weight.scales": "bfloat16",
    "model.layers.3.input_layernorm.weight": "bfloat16",
    "model.layers.3.mlp.down_proj.scales": "bfloat16",
    "model.layers.3.mlp.down_proj.weight": "int8",
    "model.layers.3.mlp.gate_proj.scales": "bfloat16",
    "model.layers.3.mlp.gate_proj.weight": "int8",
    "model.layers.3.mlp.up_proj.scales": "bfloat16",
    "model.layers.3.mlp.up_proj.weight": "int8",
    "model.layers.3.post_attention_layernorm.weight": "bfloat16",
    "model.layers.3.self_attn.k_proj.bias": "int8",
    "model.layers.3.self_attn.k_proj.bias.scales": "bfloat16",
    "model.layers.3.self_attn.k_proj.weight": "int8",
    "model.layers.3.self_attn.k_proj.weight.scales": "bfloat16",
    "model.layers.3.self_attn.o_proj.weight": "int8",
    "model.layers.3.self_attn.o_proj.weight.scales": "bfloat16",
    "model.layers.3.self_attn.q_proj.bias": "int8",
    "model.layers.3.self_attn.q_proj.bias.scales": "bfloat16",
    "model.layers.3.self_attn.q_proj.weight": "int8",
    "model.layers.3.self_attn.q_proj.weight.scales": "bfloat16",
    "model.layers.4.input_layernorm.weight": "bfloat16",
    "model.layers.4.mlp.down_proj.scales": "bfloat16",
    "model.layers.4.mlp.down_proj.weight": "int8",
    "model.layers.4.mlp.gate_proj.scales": "bfloat16",
    "model.layers.4.mlp.gate_proj.weight": "int8",
    "model.layers.4.mlp.up_proj.scales": "bfloat16",
    "model.layers.4.mlp.up_proj.weight": "int8",
    "model.layers.4.post_attention_layernorm.weight": "bfloat16",
    "model.layers.4.self_attn.k_proj.bias": "int8",
    "model.layers.4.self_attn.k_proj.bias.scales": "bfloat16",
    "model.layers.4.self_attn.k_proj.weight": "int8",
    "model.layers.4.self_attn.k_proj.weight.scales": "bfloat16",
    "model.layers.4.self_attn.o_proj.weight": "int8",
    "model.layers.4.self_attn.o_proj.weight.scales": "bfloat16",
    "model.layers.4.self_attn.q_proj.bias": "int8",
    "model.layers.4.self_attn.q_proj.bias.scales": "bfloat16",
    "model.layers.4.self_attn.q_proj.weight": "int8",
    "model.layers.4.self.attn.q_proj.weight.scales": "bfloat16"

  },
  "model_layers": {
    "model.layers.1.input_layernorm.weight_shape": [896],
    "model.layers.1.mlp.down_proj.scales_shape": [68096],
    "model.layers.1.mlp.down_proj.weight_shape": [896, 4864],
    "model.layers.1.mlp.gate_proj.scales_shape": [68096],
    "model.layers.1.mlp.gate_proj.weight_shape": [4864, 896],
    "model.layers.1.mlp.up_proj.scales_shape": [68096],
    "model.layers.1.mlp.up_proj.weight_shape": [4864, 896],
    "model.layers.1.post_attention_layernorm.weight_shape": [896],
    "model.layers.1.self_attn.k_proj.bias_shape": [128],
    "model.layers.1.self_attn.k_proj.bias_scales_shape": [2],
    "model.layers.1.self_attn.k_proj.weight_shape": [128, 896],
    "model.layers.1.self_attn.k_proj.weight_scales_shape": [1792],
    "model.layers.1.self_attn.o_proj.weight_shape": [896, 896],
    "model.layers.1.self_attn.o_proj.weight_scales_shape": [12544],
    "model.layers.1.self.attn.q_proj.bias_shape": [896],
    "model.layers.1.self.attn.q_proj.bias_scales_shape": [14],
    "model.layers.1.self.attn.q_proj.weight_shape": [896, 896],
    "model.layers.1.self.attn.q_proj.weight_scales_shape": [12544]
    
  }
}



